
admins =[
    {
        "username": "Mindahun21",
    }
]

ruls = "Game Rules:\n\
🛑🛑🛑🛑🛑🛑🛑🛑🛑🛑🛑🛑🛑\n\n\
❗❗❗❗ ATTENTION ❗❗❗❗\n\n\
1. Running within the university compound is strictly prohibited. This constitutes a severe violation as it draws attention from the community, security personnel, staff, and other students, potentially exposing our church to opposition. Any team found running within the university compound will be expelled from the game. However, running outside the compound is not prohibited even is considered a violation of the law not to run out side the university compund 😉.\n\
\n\n2. In the event of multiple teams converging during a game, each team is required to wait its turn before proceeding.\n\
\n\n3. A prize will be awarded to the winning team. The losing team, during the award ceremony, is required to stand and sing one of the penance songs performed during the final game.\n\nEnter first game code"

codes = y = ['Game1-74237', 'Game1-56499', 'Game1-17804', 'Game1-61304', 'Game1-77322', 'Game1-42059', 'Game2-10805', 'Game2-72309', 'Game2-88244',
  'Game2-15809','Game2-48720', 'Game2-58369', 'Game3-46666', 'Game3-31576', 'Game3-28012', 'Game3-87122', 'Game3-86540', 'Game3-21139',
 'Game4-93718', 'Game4-92324', 'Game4-23380', 'Game4-64741', 'Game4-20390', 'Game4-96832', 'Game-win-42373', 'Game-win-17918', 'Game-win-34155',
 'Game-win-27731', 'Game-win-43464', 'Game-win-64396', 'Game1-50449', 'Game1-75419', 'Game1-35274', 'Game2-40783', 'Game2-84905', 'Game2-41297',
 'Game3-98651', 'Game3-48165', 'Game3-82112', 'Game4-69876', 'Game4-91659', 'Game4-93634', 'Game-win-11769', 'Game-win-77752', 'Game-win-52481' ]

games ={
    "1":"ጨዋታ 1)አንድ ምስጢር ላካፍላቹ ቤታችን እኮ በፅኑ አለት ላይ በ አምስት ምሰሶዎች ቆማለች አንዱ የቱ እንደሆነ በኃላ እንድትነግሩኝ።\n\n\nሀ.ባህር ዐይታ ሸሸች\nለ. ወነበረ በየማነ አቡሁ/ በአባቱ ቀኝ ተቀመጠ \nሐ. እንዘ ኢየአምር ብእሴ\nመ. 40 መዐልት 40 ሌሊት/ ገዳመ ቆሮንቶስ \nሠ. እረኞች ዐዩት \nረ. ከሕጻናትና ከሚጠቡ ልጆች አፍ ምስጋናን አዘጋጀህ \nሰ. ሐዋርያቲሁ ከበበ እግረ አርዳኢሁ ሐጸበ/ ሐዋርያቱን ሾመ የደቀ መዛሙርቱን እግር አጠበ \nሸ. ወረደት ውስተ ምድረ ግብፅ/ወደ ግብፅ ሄደች\nቀ. ምሥጋና በሰማይ ለእግዚአብሔር ይሁን በምድርም ለሰው ልጆች ሠላም \nበ. የራስ ቅል/ ጎልጎታ \nተ. ወይንኬ አልቦሙ/በዛ በሰርግ ቤት \nቸ. ተመየጢ ሀገረኪ ናዝሬተ/ ሱላማጢስ ተመለሺ \nየ. ብርሐነከ ፈኑ ዲቤነ/ ብርሐንህን ወደኛ ላክልን \nነ. እንጀራዬን የበላ በእኔ ላይ ተረከዙን አነሳ/ የሰውን ልጅ በመሳም ትሸጣለህን\nኘ. ጥር 6 /ግዝረት\nአ. የጥበብ ሰዎች ከሩቅ ሀገር መጡ\n\n\n👉ከላይ የተሰጡትን አማራጮች በቅደም ተከተል በማስቀመጥ መልሱን ANS: ብላችሁ አስገቡ ለምሳሌ (ANS:ሀለሐመሠ)\nከዚህም ቦሃላ ይህንን የመሰለ ውጤት ይነግራችኋል (Order:y) Y ማለት ያገኛችሁት order ብዛት ነው። ሁሉንም በትክክል ስታገኙ ወደ ቀጣይ ክፍል ታልፋላችሁ።",

    "11":[
        "ከታች ከተዘረዘሩት ውስጥ ከላይ ለተጫወታችሁት ጨዋታ ገላጭ የሆነውን ምረጡ",
        ["ምስጢረ ጥምቀት","ክርስቶስ","ምስጢረ ስጋዌ","የቅዱሳን ታሪክ","ምስጢረ ሥላሴ","መጽሐፍ ቅዱስ"],
        2
    ],
    "2":"game 2 description",
    "3":"ጨዋታ 3)ሰሪን ለሰሪው እሾህን ላጣሪው\n\n\n1. ከዘመናት ሁሉ ሰንበትን ለ አከበራት \n2. ከአኃት ቤተክርስቲያን አንዷ\n3. ጉባኤ ከለባት\n 4. እግዚአብሔር ተጸጸተ\n5.በነፍስሽ ሰይፍ ያልፋል \n6. ቅዱስ ጳውሎስ \n7. ኦሪት መምህር \n8. የመጀመሪያው የስነ መለኮት ትምህርት ቤትተከፈተባት\n9. ሥራህን ሥራ!\n10. ሐዋርያቲሁ ከበበ እግረ አርዳኢሁ ሐጸበ/ የሐዋርያትን እግር አጠበ\n\n\nሀ. ስምዖን አረጋዊ\nለ. ቅዱስ ያሬድ \nሐ. ሊቢያ\nመ. የግሪክ ቤተክርስቲያን \nሠ. ልዮን\nረ. የማላንካራ ቤተክርስቲያን \nሰ. ስለ ምን ታሳድደኛለህ?\nሸ. ነነዌ\nቀ. ብጹዕ አቡነ ጐርጎርዮስ \nበ.ጸሎተ ኀሙስ \nተ. ኒቆዲሞስ\nቸ. የኬልቄዶን ጉባኤ\n\n\n👉መልሳችሁን ከ 1-10 ANS: ብላችሁ አስገቡ ለምሳሌ (ANS:ሀለሐመሠ)\nከዚህም ቦሃላ ይህንን የመሰለ ውጤት ይነግራችኋል (Correct:y) Y ማለት ያገኛችሁት Correct answer ብዛት ነው። ሁሉንም በትክክል ስታገኙ ወደ ቀጣይ ክፍል ታልፋላችሁ።",
    "4":"game 4 description",
    "5":"game 5 description",
    
}
redirect_puzzle = {
    "2":[
        "ቱሉ ሆኖ ቤቴ መሄድ ይቀናኛል ሁሌ ስወጣ ግን ካልፈተሽኩህ ይሉኛል",
        "የ ህንፃው መሀንዲስ የግንባታው ጀግና ትጉህ ሰራተኛ ማን አለ እንደ ቻይና "
    ],
    "4":[
        "መሬት ሲቆፍሩ  መአድን ነው ብዬ ውሃ ሆኖ አረፈው እረ እናንተ ሆዬ"
    ]
    
}

wrong_msg ="❗❗you entered wrong code❗❗\nplease enter correct code."

winnum=1
group_divider =0



